apache/nuttx/arch/arm/src/lpc54xx/chip/lpc546x_pinmux.h
#define GPIO_FC0_CTS_SDA_SSEL0_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN31) /* Type A */
#define GPIO_FC0_CTS_SDA_SSEL0_2     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_FC0_CTS_SDA_SSEL0_3     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN5)
#define GPIO_FC0_RTS_SCL_SSEL1_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN0)  /* Type A */
#define GPIO_FC0_RTS_SCL_SSEL1_2     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN7)
#define GPIO_FC0_RTS_SCL_SSEL1_3     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_FC0_RXD_SDA_MOSI_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN24)
#define GPIO_FC0_RXD_SDA_MOSI_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN29)
#define GPIO_FC0_RXD_SDA_MOSI_3      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN5)
#define GPIO_FC0_RXD_SDA_MOSI_4      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN0)  /* Type A */
#define GPIO_FC0_SCK_1               (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN28)
#define GPIO_FC0_SCK_2               (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN4)
#define GPIO_FC0_SCK_3               (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_FC0_TXD_SCL_MISO_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN25)
#define GPIO_FC0_TXD_SCL_MISO_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN30)
#define GPIO_FC0_TXD_SCL_MISO_3      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN6)
#define GPIO_FC0_TXD_SCL_MISO_4      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN1)  /* Type A */

#define GPIO_FC1_CTS_SDA_SSEL0_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN13) /* Type D+I */
#define GPIO_FC1_CTS_SDA_SSEL0_2     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN5)
#define GPIO_FC1_RTS_SCL_SSEL1_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN14) /* Type D+I */
#define GPIO_FC1_RTS_SCL_SSEL1_2     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN6)
#define GPIO_FC1_RTS_SCL_SSEL1_3     (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN30)
#define GPIO_FC1_RXD_SDA_MOSI_1      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN10)
#define GPIO_FC1_RXD_SDA_MOSI_2      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN3)
#define GPIO_FC1_RXD_SDA_MOSI_3      (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN28)
#define GPIO_FC1_SCK_1               (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN9)
#define GPIO_FC1_SCK_2               (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN11)
#define GPIO_FC1_SCK_3               (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_FC1_SCK_4               (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN27)
#define GPIO_FC1_TXD_SCL_MISO_1      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN11)
#define GPIO_FC1_TXD_SCL_MISO_2      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN4)
#define GPIO_FC1_TXD_SCL_MISO_3      (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN10) /* Type A */
#define GPIO_FC1_TXD_SCL_MISO_4      (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN29)

#define GPIO_FC2_CTS_SDA_SSEL0_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN26)
#define GPIO_FC2_CTS_SDA_SSEL0_2     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN23) /* Type D+I */
#define GPIO_FC2_CTS_SDA_SSEL0_3     (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN11)
#define GPIO_FC2_CTS_SDA_SSEL0_4     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN23)
#define GPIO_FC2_RTS_SCL_SSEL1_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN27)
#define GPIO_FC2_RTS_SCL_SSEL1_2     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN24) /* Type D+I */
#define GPIO_FC2_RTS_SCL_SSEL1_3     (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN12)
#define GPIO_FC2_RTS_SCL_SSEL1_4     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN22)
#define GPIO_FC2_RXD_SDA_MOSI_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN26)
#define GPIO_FC2_RXD_SDA_MOSI_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN24)
#define GPIO_FC2_RXD_SDA_MOSI_3      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN9)
#define GPIO_FC2_RXD_SDA_MOSI_4      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN20)
#define GPIO_FC2_SCK_1               (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN23)
#define GPIO_FC2_SCK_2               (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN8)
#define GPIO_FC2_SCK_3               (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN19)
#define GPIO_FC2_TXD_SCL_MISO_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN27)
#define GPIO_FC2_TXD_SCL_MISO_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN25)
#define GPIO_FC2_TXD_SCL_MISO_3      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN10)
#define GPIO_FC2_TXD_SCL_MISO_4      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN21)

#define GPIO_FC3_CTS_SDA_SSEL0_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN20)
#define GPIO_FC3_CTS_SDA_SSEL0_2     (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN1)
#define GPIO_FC3_CTS_SDA_SSEL0_3     (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN21)
#define GPIO_FC3_RTS_SCL_SSEL1_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN21)
#define GPIO_FC3_RTS_SCL_SSEL1_2     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN7)
#define GPIO_FC3_RTS_SCL_SSEL1_3     (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN20)
#define GPIO_FC3_RXD_SDA_MOSI_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN3)
#define GPIO_FC3_RXD_SDA_MOSI_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN1)
#define GPIO_FC3_RXD_SDA_MOSI_3      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN18)
#define GPIO_FC3_SCK_1               (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN6)
#define GPIO_FC3_SCK_2               (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN0)
#define GPIO_FC3_SCK_3               (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN26)
#define GPIO_FC3_SSEL2_1             (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN9)
#define GPIO_FC3_SSEL2_2             (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN27)
#define GPIO_FC3_SSEL2_3             (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN23)
#define GPIO_FC3_SSEL3_1             (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN8)
#define GPIO_FC3_SSEL3_2             (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN2)
#define GPIO_FC3_SSEL3_3             (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN24)
#define GPIO_FC3_TXD_SCL_MISO_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN12) /* Type A */
#define GPIO_FC3_TXD_SCL_MISO_2      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN2)
#define GPIO_FC3_TXD_SCL_MISO_3      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT2 | GPIO_PIN19)

#define GPIO_FC4_CTS_SDA_SSEL0_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN18)
#define GPIO_FC4_CTS_SDA_SSEL0_2     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN28)
#define GPIO_FC4_CTS_SDA_SSEL0_3     (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN2)
#define GPIO_FC4_CTS_SDA_SSEL0_4     (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN9)
#define GPIO_FC4_RTS_SCL_SSEL1_1     (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN19)
#define GPIO_FC4_RTS_SCL_SSEL1_2     (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN29)
#define GPIO_FC4_RTS_SCL_SSEL1_3     (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN3)
#define GPIO_FC4_RTS_SCL_SSEL1_4     (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN15)
#define GPIO_FC4_RXD_SDA_MOSI_1      (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN5)
#define GPIO_FC4_RXD_SDA_MOSI_2      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN26)
#define GPIO_FC4_RXD_SDA_MOSI_3      (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN0)
#define GPIO_FC4_RXD_SDA_MOSI_4      (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN21)
#define GPIO_FC4_SCK_1               (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN4)
#define GPIO_FC4_SCK_2               (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN25)
#define GPIO_FC4_SCK_3               (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN31)
#define GPIO_FC4_SCK_4               (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN19)
#define GPIO_FC4_SSEL2_1             (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN17)
#define GPIO_FC4_SSEL2_2             (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN30)
#define GPIO_FC4_SSEL2_3             (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN4)
#define GPIO_FC4_SSEL2_4             (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN8)
#define GPIO_FC4_SSEL3_1             (GPIO_ALT2 | GPIO_MODE_DIGITAL | GPIO_PORT4 | GPIO_PIN4)
#define GPIO_FC4_SSEL3_2             (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN5)
#define GPIO_FC4_SSEL3_3             (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN22)
#define GPIO_FC4_TXD_SCL_MISO_1      (GPIO_ALT1 | GPIO_MODE_DIGITAL | GPIO_PORT0 | GPIO_PIN16) /* Type A */
#define GPIO_FC4_TXD_SCL_MISO_2      (GPIO_ALT3 | GPIO_MODE_DIGITAL | GPIO_PORT3 | GPIO_PIN27)
#define GPIO_FC4_TXD_SCL_MISO_3      (GPIO_ALT4 | GPIO_MODE_DIGITAL | GPIO_PORT5 | GPIO_PIN1)
#define GPIO_FC4_TXD_SCL_MISO_4      (GPIO_ALT5 | GPIO_MODE_DIGITAL | GPIO_PORT1 | GPIO_PIN20)

